[
    {
        "front": "<b>Q1. What is an example of dynamic binding?</b>\n- any method\n- method overloading\n- method overriding\n- compiling",
        "back": "method overriding"
    },
    {
        "front": "<b>Q2. For which case would the use of a static attribute be appropriate?</b>\n- the number of people in each house in a small neighborhood\n- the lot size for each house in a small neighborhood\n- the color of each house in a small neighborhood\n- the weather conditions for each house in a small neighborhood",
        "back": "the weather conditions for each house in a small neighborhood"
    },
    {
        "front": "<b>Q3. 1 Why would you create an abstract class, if it can have no real instances?</b>\n- to avoid redundant coding in children\n- to explore a hypothetical class\n- to prevent unwanted method implementation\n- to reserve memory for an unspecified class type",
        "back": "to avoid redundant coding in children"
    },
    {
        "front": "<b>Q4. 2 Why would you create an abstract class, if it can have no real instances?</b>\n- to have common behavior in derived classes\n- to explore a hypothetical class\n- to prevent unwanted method implementation\n- to reserve memory for an unspecified class type",
        "back": "to have common behavior in derived classes"
    },
    {
        "front": "<b>Q5. When does static binding happen?</b>\n- only when you export\n- both at compile time and runtime\n- at compile time\n- at runtime",
        "back": "at compile time"
    },
    {
        "front": "<b>Q6. What is the best reason to use a design pattern?</b>\n- It will result in code that is more extensible and maintainable\n- It will result in a more compact product.\n- It will speed initial development.\n- It will allow you to add that design pattern to your resume.",
        "back": "It will result in code that is more extensible and maintainable"
    },
    {
        "front": "<b>Q7. What is encapsulation?</b>\n- defining classes by focusing on what is important for a purpose\n- hiding the data and implementation details within a class\n- making all methods private\n- using words to define classes",
        "back": "hiding the data and implementation details within a class"
    },
    {
        "front": "<b>Q8. What is an IS-A relationship?</b>\n- It implies encapsulation.\n- A superclass object has an IS-A relationship with its subclass.\n- It implies a virtual method.\n- A subclass object has an IS-A relationship with its superclass or interface",
        "back": "A subclass object has an IS-A relationship with its superclass or interface"
    },
    {
        "front": "<b>Q9. You want a method with behavior similar to a virtual method--it is meant to be overridden --expect that it does not have a method body. It just has a method signature. What kind of method should you use?</b>\n- an abstract method\n- a public internal method\n- an internal method\n- a protected internal method",
        "back": "an abstract method"
    },
    {
        "front": "<b>Q10. Which code creates a new object from the Employee class?</b>\n- Employee currentEmployee = Employee.Create();\n- Employee currentEmployee = new Employee();\n- Employee currentEmployee;\n- Employee currentEmployee = Employee.New();",
        "back": "Employee currentEmployee = new Employee();"
    },
    {
        "front": "<b>Q11. Which type of constructor cannot have a return type?</b>\n- default\n- copy\n- parameterized\n- Constructors do not have a return type",
        "back": "Constructors do not have a return type"
    },
    {
        "front": "<b>Q12. 1 When is a constructor executed?</b>\n- when an object is created from a class using the new keyword\n- when an class is defined using the class keyword\n- every time an object is referenced\n- when an object is created from a class using the create keyword",
        "back": "when an object is created from a class using the new keyword"
    },
    {
        "front": "<b>Q13. 2 When is a constructor executed?</b>\n- when an object is created from a class\n- when an class is defined using the class keyword\n- every time an object is referenced\n- when an object is created from a class using the create keyword",
        "back": "when an object is created from a class"
    },
    {
        "front": "<b>Q14. If a local class is defined in a function, what is true for an object of that class?</b>\n- The object can be accessed, declared, and used locally in that function.\n- The object must be declared inside any other function.\n- The object is temporarily accessible outside the function.\n- The object can call all the other class members anywhere in the program.",
        "back": "The object can be accessed, declared, and used locally in that function."
    },
    {
        "front": "<b>Q15. Which two blocks are used to handle and check errors?</b>\n- do and check\n- catching and trying\n- try and catch\n- do and while",
        "back": "try and catch"
    },
    {
        "front": "<b>Q16. Why would you implement composition using an id instead of a reference?</b>\n- It makes it easier to save the entity.\n- all of these answers\n- It can make the entity retrieval more efficient\n- It minimizes coupling.",
        "back": "all of these answers"
    },
    {
        "front": "<b>Q17. Which statement best describes the method of inheritance in OOP?</b>\n- Inheritance describes the ability to create new classes based on an existing class.\n- Inheritance means that a group of related properties, methods, and other members are treated as a single unit or object.\n- Inheritance forces a class to have a single responsibility from only one parent.\n- Inheritance means that you will never have multiple classes that can be used interchangeably, even though each class implements the same properties or methods in different ways.",
        "back": "Inheritance describes the ability to create new classes based on an existing class."
    },
    {
        "front": "<b>Q18. Which type of inheritance ,when done continuously, is similar to a tree structure?</b>\n- multilevel\n- hierarchical and multiple\n- hierarchical\n- multiple",
        "back": "hierarchical"
    },
    {
        "front": "<b>Q19. Which statement is true?</b>\n- A default parameter's constructor is not equivalent to the default constructor\n- A default constructor is inherited from a parent class\n- A default constructor can be called explicitly\n- A default constructor cannot be defined by the coder",
        "back": "A default parameter's constructor is not equivalent to the default constructor"
    },
    {
        "front": "<b>Q20. Which of the following is NOT an advantage of using getters and setters?</b>\n- Getters and setters can speed up compilation.\n- Getters and setters provide encapsulation of behavior.\n- Getters and setters provide a debugging point for when a property changes at runtime.\n- Getters and setters permit different access levels.",
        "back": "Getters and setters can speed up compilation."
    },
    {
        "front": "<b>Q21. In context of OOP, what is association?</b>\n- Association is a relationship where all objects have their own life cycle and there is no owner.\n- Association is the process where model elements cooperate to provide higher-level behavior.\n- Association is whole/part relationship where one object is composed of one or more other objects, each of which is considered a part of the whole.\n- Association is where all objects have their own life cycle, but there is ownerhip, and child objects can not belong to another parent object.",
        "back": "Association is a relationship where all objects have their own life cycle and there is no owner."
    },
    {
        "front": "<b>Q22. How are user stories different from use cases?</b>\n- User Stories are shorter and less detailed.\n- User stories are more accurate.\n- User stories are more detailed and structured.\n- User storised are more anecdotal and personal.",
        "back": "User Stories are shorter and less detailed."
    },
    {
        "front": "<b>Q23. Which type of inheritance must be used so that the resultant is hybrid?</b>\n- multiple\n- any type of inheritance\n- multilevel\n- hierarchical\n```\n- Single Inheritance is where a derived class inherits properties and behaviour from a single base class. Example: Class A → Class B.\n- Hierarchical Inheritance is where more than one derived class is created from a single base class. Example: Class A → Class B → Class C.\n- Multiple Inheritance is for deriving a class from multiple base classes. Here, the child objects programmers create will have combined aspects of characteristics and features from multiple parent classes. These objects do follow their hierarchies of base classes.\n- Multilevel Inheritance is where a child class is derived from another derived class. This feature carries combined aspects of multiple classes and follows their hierarchies.\n- Hybrid Inheritance is a heterogeneous feature of using multiple inheritances. Here a child class is derived from one or more combinations of single, hierarchical, and multilevel inheritances. This inheritance is adopted for programs to mix different types of inheritance; for example, when mixing a single inheritance with multiple inheritances or maybe a situation when multiple inheritances are mixed within a single program.\n```",
        "back": "multiple\n\n[reference](https://www.codingninjas.com/blog/2021/09/23/hybrid-inheritance-in-java)"
    },
    {
        "front": "<b>Q24. A language that does not support polymorphism but supports classes is considered what?</b>\n- an object-based language\n- a class-based language\n- a procedure-oriented language\n- if classes are supported, polymorphism will be supported",
        "back": "an object-based language"
    },
    {
        "front": "<b>Q25. Two classes combine private data members and provide public member functions to access and manipulate those data members. Where is abstraction used?</b>\n- Abstraction is using a private access specifier for the data members.\n- Abstraction is using public member functions to access and manipulate the data members.\n- Abstraction is using the class concept with both data members and member functions.\n- There is insufficient information to decide where abstraction is being used.",
        "back": "Abstraction is using public member functions to access and manipulate the data members."
    },
    {
        "front": "<b>Q26. What are the five Creational Design patterns by the Gang of Four ?</b>\n- Observer, State, Strategy, Template Method, and Visitor.\n- Composite, Visitor, State, Prototype, and Singleton.\n- Composite, Builder, Factory Method, Prototype, and Singleton.\n- Abstract Factory, Builder, Factory Method, Prototype, and Singleton.",
        "back": "Abstract Factory, Builder, Factory Method, Prototype, and Singleton."
    },
    {
        "front": "<b>Q27. In multilevel inheritance, one class inherits how many classes?</b>\n- one class only\n- two classes\n- as many classes as required\n- at least two classes",
        "back": "one class only"
    },
    {
        "front": "<b>Q28. if an object is passed by reference, the changes made in the function are reflected \\_.</b>\n- to the main object of the caller function, too\n- on the caller function object and also the called function object\n- on the copy of the object that is made during the pass\n- only in the local scope of the called function",
        "back": "to the main object of the caller function, too"
    },
    {
        "front": "<b>Q29. What is a method?</b>\n- a set of instructions designed to perform a frequently used operation within a program and return no values\n- the exact same thing as a function and subroutine\n- a set of variables that can change over time\n- They are functions attached to specific classes (or instances) in object-oriented programming.",
        "back": "They are functions attached to specific classes (or instances) in object-oriented programming."
    },
    {
        "front": "<b>Q30. A mobile phone is made up of components such as a motherboard, camera, and sensors. The motherboard represents all the functions of a phone, the display shows the display only, and the phone is represented as a whole. Which of the following has the highest level of abstraction?</b>\n- camera\n- display\n- motherboard\n- mobile phone",
        "back": "mobile phone"
    },
    {
        "front": "<b>Q31. Which class has the highest degree of abstraction in a multilevel inheritance relationship of five levels?</b>\n- the class at the third level\n- the class at the first level\n- All have the same degree of abstraction.\n- the class at the second level",
        "back": "the class at the first level"
    },
    {
        "front": "<b>Q32. Which is NOT one of the basic types of inheritance?</b>\n- multilevel inheritance\n- double inheritance\n- single inheritance\n- hierarchical inheritance",
        "back": "double inheritance"
    },
    {
        "front": "<b>Q33. Why is code duplication so insidious?</b>\n- The duplication uses unnecessary space.\n- One has to maintain all the duplicates.\n- Duplication can cause intellectual property concerns.\n- Duplication is easy to hide.",
        "back": "One has to maintain all the duplicates."
    },
    {
        "front": "<b>Q34. When and how often is a static constructor called?</b>\n- It is called initially when an object is created and called with every new object instance.\n- It is called when an object is destroyed and only one time.\n- It is called initially when an object is created and only one time.\n- It is created at time when the object is discarded.",
        "back": "It is called initially when an object is created and only one time."
    },
    {
        "front": "<b>Q35. What does the code shown below demonstrate, and why?</b>\n```cpp\n   static void Multiply(int num1, int num2) {};\n   static void Multiply(double num1, double num2, double num3) {};\n   static void Multiply(float num1, float num2) {};\n```\n- polymorphism, because each method can perform different task\n- method overriding, because it display the same method name, different or same parameters, and same return type\n- method overloading, because it allows the creation of several methods with the same name, wich differ by the type of input via parameter\n- method overriding, because it display the same method name, different parameters, and same return type",
        "back": "method overloading, because it allows the creation of several methods with the same name, wich differ by the type of input via parameter"
    },
    {
        "front": "<b>Q36. What is the purpose of static constructor?</b>\n- to initialize all the members with static value\n- to delete the static members when not required\n- to initialize the static members of class\n- to clear all the static members' initialized values",
        "back": "to initialize all the members with static value"
    },
    {
        "front": "<b>Q37. What are CRC Cards?</b>\n- Code Responsibility Collection cards are a brainstorming tool used in the design of procedural software\n- Class Responsibility collaboration cards are a brainstorming tool used in the design of oop software\n- Code Responsibility Correction cards are tools used for debugging\n- Code Responsibility Correction cards are tools for modeling",
        "back": "Class Responsibility collaboration cards are a brainstorming tool used in the design of oop software\n\n[reference link](https://en.wikipedia.org/wiki/Class-responsibility-collaboration_card)"
    },
    {
        "front": "<b>Q38. 1 How are contents of a composition different from those of aggregation?</b>\n- if one element of an aggregation is dereferenced, all its elements are eligible for garbage collection\n- if a composition dies, the contents die\n- the contents of a composition are all siblings\n- an aggregation contains only abstract classes",
        "back": "if a composition dies, the contents die"
    },
    {
        "front": "<b>Q39. 2 Which statement about compositions and aggregations is true?</b>\n- if one element of an aggregation is dereferenced, all its elements are eligible for garbage collection\n- if a composition dies, the contents die\n- the contents of a composition are all siblings\n- an aggregation contains only abstract classes",
        "back": "if a composition dies, the contents die"
    },
    {
        "front": "<b>Q40. What is the result of using more abstraction?</b>\n- it can increase code vulnerability\n- it can make code unsafe\n- it can limit code readability\n- it can be safer for coding",
        "back": "it can limit code readability"
    },
    {
        "front": "<b>Q41. Which is false for a member function of a class?</b>\n- Member functions can be defined only inside or outside the class body.\n- Member functions can be made to be friends of another class.\n- Member functions do not need to be declared inside the class definition.\n- All member functions need to be defined.",
        "back": "Member functions do not need to be declared inside the class definition."
    },
    {
        "front": "<b>Q42. Why is inheritance used when creating a new class?</b>\n- to protect attributes from unwanted changes\n- to delegate coding responsibility more efficiently\n- to conserve memory\n- to avoid writing duplicate code\n- to separate class behavior from the more general\n**NOTE:** I don't have 4th variant in my test, it changed to new 5th variant. Is it also true?",
        "back": "to avoid writing duplicate code"
    },
    {
        "front": "<b>Q43. In addition to attributes and behaviours, what quality must a class possess?</b>\n- a name\n- a state\n- a color\n- an object",
        "back": "a name"
    },
    {
        "front": "<b>Q44. Which type of function among the following shows polymorphism?</b>\n- inline function\n- undefined function\n- virtual function\n- class member function",
        "back": "virtual function"
    },
    {
        "front": "<b>Q45. Which words in the following list are candidates for objects: trumpet, clean, enrage, leaf, tree, collapse, active, and lively?</b>\n- leaf and tree\n- clean, enrage, and collapse\n- clean, active, and lively\n- leaf, tree, and trumpet",
        "back": "leaf, tree, and trumpet"
    },
    {
        "front": "<b>Q46. What best describes what object-oriented programming does?</b>\n- It focuses on objects that interact cleanly with one another.\n- It programs exclusively to interfaces.\n- It programs exclusively to classes.\n- It creates one class for all business logic.",
        "back": "It focuses on objects that interact cleanly with one another."
    },
    {
        "front": "<b>Q47. Can abstract classes be used in multilevel inheritance?</b>\n- No, abstract classes can be used only in single-level inheritance since they must be immediately implemented.\n- yes, always\n- yes, but with only one abstract class\n- No, abstract classes do not have constructors.",
        "back": "yes, always"
    },
    {
        "front": "<b>Q48. What type of inheritance may lead to the diamond problem?</b>\n- single level\n- multilevel\n- hierarchical\n- multiple",
        "back": "multiple"
    },
    {
        "front": "<b>Q49. What is the relationship between abstraction and encapsulation?</b>\n- Abstraction is about making relevant information visible, while encapsulation enables a programmer to implement the desired level of abstraction.\n- Abstraction and encapsulation are essentially the same.\n- Abstraction and encapsulation are unrelated.\n- Encapsulation is about making relevant information visible, while abstraction enables a programmer to implement the desired level of encapsulation.",
        "back": "Abstraction is about making relevant information visible, while encapsulation enables a programmer to implement the desired level of abstraction."
    },
    {
        "front": "<b>Q50. Which of these keywords are access specifiers?</b>\n- abstract and public\n- public and private\n- this and final\n- final and abstract",
        "back": "public and private"
    },
    {
        "front": "<b>Q51. What is a reference to an object?</b>\n- It is the address of variable only -- not the method of an object.\n- It is a shallow pointer that contains address of an object.\n- It is the physical address of an object.\n- It is the address where the variables and methods of an object are stored.",
        "back": "It is the address where the variables and methods of an object are stored."
    },
    {
        "front": "<b>Q52. Why is unit testing harder in OOP than functional programming?</b>\n- Objects may maintain internal state, which is not easily accessible by the tests.\n- The quality of unit testing frameworks for functional languages is better.\n- OOP promotes code reuse, which means that your tests have to consider more use cases.\n- Object-oriented languages tend to rely on frameworks such as Spring or Hibernate, which make them difficult to test.",
        "back": "Objects may maintain internal state, which is not easily accessible by the tests."
    },
    {
        "front": "<b>Q53. What is the function of a user diagram?</b>\n- It connects actors to use cases.\n- It links actors to roles played in all use cases.\n- It lists all actors for each use case.\n- It minimizes the number of actors required.",
        "back": "It links actors to roles played in all use cases."
    },
    {
        "front": "<b>Q54. How do object behaviors and attributes differ?</b>\n- Behavior describe dynamic properties; attributes are static.\n- Attributes describe a state; behaviors describe a change.\n- Attributes apply only to a specified object; behavior apply to other linked objects.\n- Behaviors are vector quantities; attributes are scalars.",
        "back": "Attributes describe a state; behaviors describe a change."
    },
    {
        "front": "<b>Q55. The open/closed principle states that classes should be open for \\_ but closed for \\_.</b>\n- refactoring; duplication\n- modification; duplication\n- extension; modification\n- reuse; encapsulation",
        "back": "extension; modification"
    },
    {
        "front": "<b>Q56. Why would you override a method of a base class?</b>\n- to define a method that must be implemented in a derived class\n- to define a custom implementation of an inherited member\n- to define a method that must be implemented in a superclass only\n- to define a class that can be inherited from",
        "back": "to define a custom implementation of an inherited member"
    },
    {
        "front": "<b>Q57. What is a copy constructor?</b>\n- It is a unique constructor for creating a new object as a copy of an object that already exists. There will always be only one copy constructor that can be either defined by the user or the system.\n- It is a constructor that duplicates itself when requested on demand.\n- It is a common constructor for preventing the creation of a new object as a copy of an object that already exists. There will always be multiple standard constructors that can be either defined by the user or the system.\n- It is a constructor that duplicates itself on its own, based on memory available.",
        "back": "It is a unique constructor for creating a new object as a copy of an object that already exists. There will always be only one copy constructor that can be either defined by the user or the system."
    },
    {
        "front": "<b>Q58. What defines the catch block most accurately?</b>\n- The catch block that will be executed is the one that best matches the type of exception thrown.\n- Multiple catch blocks can never be associated with a single try block.\n- Multiple catch blocks are mandatory for each try block.\n- Multiple catch blocks will all be executed in the case of an exception.",
        "back": "The catch block that will be executed is the one that best matches the type of exception thrown."
    },
    {
        "front": "<b>Q59. There are five classes. Class E is derived from class D, D from C, C from B, and B from A. Which class constructor(s) will be called first if the object of E or D is created?</b>\n- A\n- B\n- C\n- C and B",
        "back": "A"
    },
    {
        "front": "<b>Q60. You have modules that are dependent on each other. If you change one module, you have to make changes in the dependent modules. What term is used to describe this problem, and what is a potential solution?</b>\n- Cohesion. A solution is to show that each module has certain responsibilities and to use an anticohesive design pattern.\n- Encapsulation. A solution is to implement one of the SOLID principles to ensure the modules do not encapsulate with each other.\n- Coupling. A solution is to refactor the code to be loosely coupled by using inversion of control and dependency injection.\n- Dependency. A solution is to implement polymorphism and abstraction to change and extract dependent elements of a module so that it functions on its own.",
        "back": "Coupling. A solution is to refactor the code to be loosely coupled by using inversion of control and dependency injection."
    },
    {
        "front": "<b>Q61. **\\_** describes an aggregation</b>\n- A class of resources\n- A group of methods\n- A collection of objects\n- A list of children",
        "back": "A collection of objects"
    },
    {
        "front": "<b>Q62. Which type of function can be used for polymorphism?</b>\n- virtual function\n- inline function\n- undefined function\n- private function",
        "back": "virtual function"
    },
    {
        "front": "<b>Q63. Which choice is a benefit of using dependency injection?</b>\n- loose coupling\n- code reusability\n- lazy initialization\n- data abstraction",
        "back": "loose coupling"
    },
    {
        "front": "<b>Q64. Are you required to return an object if it was passed by reference to a function, and why or why not?</b>\n- Yes, the caller function needs to reflect the changes.\n- No, you should use a global variable instead.\n- No, changes will be automatically reflected in the calling function.\n- Yes, the object must be the same in the caller function.",
        "back": "No, changes will be automatically reflected in the calling function."
    },
    {
        "front": "<b>Q65. Why is inheritance?</b>\n- ...",
        "back": "..."
    },
    {
        "front": "<b>Q66. What is the best example of a superclass and subclass relationship?</b>\n- car:toyota\n- ducks:pond\n- toes:feet\n- rock:stone",
        "back": "car:toyota"
    },
    {
        "front": "<b>Q67. Which statements best describe the Gang of Four design patterns called Memento and Observer?</b>\n- Memento notifies multiple classes of changes. Observer captures and restores an object's internal state.\n- Memento defers the exact steps of an algorithm to a subclass. Observer defines a new operation to a class without change.\n- Memento alters an object's behavior when its state changes. Observer encapsulates an algorithm inside a class.\n- Memento captures and restores an object's internal state. Observer notifies multiple classes of changes.",
        "back": "Memento captures and restores an object's internal state. Observer notifies multiple classes of changes."
    },
    {
        "front": "<b>Q68. What does the value (0.5,0.5,0.5) indicate in the class diagram specification position: Coordinate = (0.5,0.5,0.5)?</b>\n- a default value of the Coordinate attribute\n- the size of the position array\n- an increment of the position attribute value\n- a default value of the position attribute",
        "back": "a default value of the position attribute"
    },
    {
        "front": "<b>Q69. What is the most accurate example of the Liskov substitution principle?</b>\n- A\n```java\npublic class Car{\n}\npublic class FlyingCars extends Car{\n   public void fly(){}\n}\npublic class Tesla FlyingCar{}\npublic class Honda Car{}\n```\n- B\n```java\npublic class Car{\n   public void fly(){}\n}\npublic class Tesla extends Car{}\npublic class Honda extends Car{}\n```\n- C\n```java\npublic class Car{\npublic void fly(){}\n}\npublic class Tesla Car{}\npublic class Honda Car{}\n```\n- D\n```java\npublic class Car{\n}\npublic class FlyingCars extends Car{\n   public void fly(){}\n}\npublic class Tesla extends FlyingCar{}\npublic class Honda extends Car{}\n```",
        "back": "D\n```java\npublic class Car{\n}\npublic class FlyingCars extends Car{\n   public void fly(){}\n}\npublic class Tesla extends FlyingCar{}\npublic class Honda extends Car{}\n```\n\n[reference link](https://stackoverflow.com/a/44913313/1573267)"
    },
    {
        "front": "<b>Q70. What is the difference between a parameter and an argument?</b>\n- An argument can have many values while a parameter can have only one value.\n- An argument is the variable used for input values in a method. A parameter is the specific input value passed to the method.\n- A parameter is a variable in the declaration of a function. An argument is the value of this variable that gets passed to the function.\n- Parameters and arguments are the same",
        "back": "A parameter is a variable in the declaration of a function. An argument is the value of this variable that gets passed to the function."
    },
    {
        "front": "<b>Q71. What is the scope of a class nested inside another class?</b>\n- Protected scope\n- Private scope\n- Global scope\n- Depends on access specifier and inheritance used\n> Explanation: It depends on the access specifier and the type of inheritance used with the class, because if the class is inherited then the nested class can be used by subclass too, provided it’s not of private type.",
        "back": "Depends on access specifier and inheritance used\n> Explanation: It depends on the access specifier and the type of inheritance used with the class, because if the class is inherited then the nested class can be used by subclass too, provided it’s not of private type."
    },
    {
        "front": "<b>Q72. Methods and attributes that define an object are a kind of blueprint called what?</b>\n- a collection\n- a variable\n- a class\n- a procedure",
        "back": "a class"
    },
    {
        "front": "<b>Q73. Assume single inheritance is used with classes A and B while A is the base class. Then assume classes C, D, and E, where C is a base class and D is derived from C, then E is derived from D. Class C is made to inherit from class B. Which type of inheritance is reflected?</b>\n- Multilevel\n- Hybrid\n- Single level\n- Multiple",
        "back": "Multilevel"
    },
    {
        "front": "<b>Q74. What is the main idea behind separation of concerns?</b>\n- All of these answers\n- Applications are decomposed into parts\n- Parts are defined with minimal overlap\n- Each part is responsible for a separate concern",
        "back": "All of these answers"
    },
    {
        "front": "<b>Q75. What is the purpose of the finally block?</b>\n- To always run the finally block of code when the try block exits\n- To run code when an exception has not occurred\n- To run the block if an exception occurred\n- To run code whenever garbage collection requires it",
        "back": "To always run the finally block of code when the try block exits"
    },
    {
        "front": "<b>Q76. Which choice is not an OOP language?</b>\n- C#\n- Java\n- C\n- Python",
        "back": "C"
    },
    {
        "front": "<b>Q77. What is the function of a finalizer or destructor?</b>\n- To relinquish resources that are no longer needed\n- To delete a variable name\n- To reset an attribute value\n- To hold space, even after an object is no longer being used",
        "back": "To relinquish resources that are no longer needed"
    },
    {
        "front": "<b>Q78. An instance of which type of class cannot be created?</b>\n- Protected class\n- Base class\n- Anonymous class\n- Abstract class",
        "back": "Abstract class"
    },
    {
        "front": "<b>Q79. In the context of OOP, what is composition?</b>\n- Composition is the act of one object passing to another object an operation to be performed on behalf of the initial object.\n- Composition is a part/whole relationship where an object is composed of one or more other objects, each of which is considered a part of the whole.\n- Composition is a binding where the class/name association is not made until the object designated by the name is created at execution time\n- Composition is a process of collecting classes that provide a set of services for a particular domain",
        "back": "Composition is a part/whole relationship where an object is composed of one or more other objects, each of which is considered a part of the whole."
    },
    {
        "front": "<b>Q80. Static polymorphism uses method \\_ ?</b>\n- overloading\n- inheritance\n- abstraction\n- overriding",
        "back": "overloading"
    },
    {
        "front": "<b>Q81. What does a concrete class not have?</b>\n- parents\n- pure virtual functions\n- attributes\n- purposes",
        "back": "pure virtual functions"
    },
    {
        "front": "<b>Q82. How does dynamic typing complicate troubleshooting?</b>\n- It can be difficult to identify variables that are incorrectly typed\n- The dynamic variables can assume only limited values\n- Storage is fixed for dynamic variables\n- Static variables are more flexible than dynamic variables",
        "back": "It can be difficult to identify variables that are incorrectly typed"
    },
    {
        "front": "<b>Q83. What is the difference between early binding and late binding?</b>\n- Early binding is when a variable is assigned a value when a scope is created. Late binding is when a variable is assigned a value after a scope is exited\n- Early binding is when a variable is assigned a value when the program starts. Late binding is when a variable is assigned after the program is running\n- There is no difference. In both cases, variables are assigned values when a program has completed startup and is running\n- Early binding is when a variable is assigned its value at compile time. Late binding is when a variable is assigned a value at run time",
        "back": "Early binding is when a variable is assigned its value at compile time. Late binding is when a variable is assigned a value at run time"
    },
    {
        "front": "<b>Q84. What is the difference between an interface and an abstract class?</b>\n- Interfaces can contain code or data. Abstract classes do not contain code or data. A class can inherit from more than one abstract class but can only implement one interface\n- Interfaces can contain code or data. Abstract classes do not contain code or data. A class can inherit from only one abstract class but can implement an unlimited number of interface\n- Abstract classes can contain code or data. Interface do not contain code or data. A class can inherit from only one abstract class but can implement an unlimited number of interfaces\n- Abstract classes can contain code or data. Interface do not contain code or data. A class can inherit from more than one abstract class but can only implement one interface",
        "back": "Abstract classes can contain code or data. Interface do not contain code or data. A class can inherit from only one abstract class but can implement an unlimited number of interfaces"
    },
    {
        "front": "<b>Q85. What parameters are required to be passed to a class constructor?</b>\n`Here they haven't mentioned any specific language so let's consider all languages.`\n- reference to subclass // References to subclass are never required as you can simply Initialize subclass & use their object.\n- reference to base class // References to the base class are not required in Java, Javascript & Python\n- reference to this pointer // While Python & Javascript may require passing this or self in the constructor, It is not passed in Java constructor.\n- none // Above 3 are incorrect so \"none\" is the answer",
        "back": "none // Above 3 are incorrect so \"none\" is the answer"
    },
    {
        "front": "<b>Q86. What are the four principles of object-oriented programming?</b>\n- manipulation, encapsulation, inheritance, and dependency inversion\n- dependency inversion, open/closed principle, encapsulation, and inheritance\n- interface segregation, abstraction, dependency inversion, and inheritance\n- abstraction, encapsulation, inheritance, and polymorphism",
        "back": "abstraction, encapsulation, inheritance, and polymorphism"
    },
    {
        "front": "<b>Q87. From the SOLID principles of object-oriented programming, which statement best describes the Liskov substitution principle?</b>\n- A class should have only a single responsibility—that is, only changes to one part of the software's specification should be able to affect the specification of the class.\n- Software entities should be open for extension, but closed for modification.\n- Many client-specific interfaces are better than one general-purpose interface.\n- objects in a program should be replaceable with instances of their subtypes without altering the correctness of that program.",
        "back": "objects in a program should be replaceable with instances of their subtypes without altering the correctness of that program."
    },
    {
        "front": "<b>Q88. In addition to responsibilities, what should be listed on Class-responsability-collaboration (CRC) cards?</b>\n- which programming language will be used.\n- the programmer responsible for implementation.\n- interacting classes.\n- attributes.",
        "back": "attributes."
    },
    {
        "front": "<b>Q89. What is the best name for the function that corrects this assessment?</b>\n- makeResult()\n- questionScore()\n- calculateScore()\n- getAnswers()",
        "back": "calculateScore()"
    },
    {
        "front": "<b>Q90. Which relationship best illustrates an abstract-concrete class relationship?</b>\n- cat : kitten\n- color : red\n- planet : moon\n- truck : window",
        "back": "planet : moon"
    },
    {
        "front": "<b>Q91. What cannot be used for polymorphism?</b>\n- overloading constructors\n- overloading member functions\n- static member functions\n- overloading predefined operator",
        "back": "static member functions"
    },
    {
        "front": "<b>Q92. How many levels does multilevel inheritance allow in a program?</b>\n- only 10 levels of inheritance\n- as many levels of inheritance as required within 10 minutes\n- as many levels of inheritance as required\n- only the amount of levels memory permits, divided by processor speed",
        "back": "only the amount of levels memory permits, divided by processor speed"
    },
    {
        "front": "<b>Q93. What is a virtual Method?</b>\n- a method that you expect may be redefined in derived classes\n- a method that you do not expect to be redefined in derived classes\n- a private method that you do not expect to be redefined in derived public classes\n- a method that exists temporarily - once used, it ceases to be used by any caller",
        "back": "a method that you expect may be redefined in derived classes"
    },
    {
        "front": "<b>Q94. Which of these is not a basic principle of Object Oriented Programming?</b>\n- Encapsulation\n- Compilation\n- Inheritance\n- Polymorphism",
        "back": "Compilation\n\n[Reference](https://www.interviewbit.com/blog/principles-of-oops/)"
    },
    {
        "front": "<b>Q95. How do object behaviours and attributes differ?</b>\n- Behaviour describe dynamic properties; attributes are static.\n- Attributes describe a state; behaviours describe a change.\n- Attributes apply only to a specified object; behaviour apply to other linked objects.\n- Behaviours are vector quantities; attributes are scalars.",
        "back": "Attributes describe a state; behaviours describe a change."
    },
    {
        "front": "<b>Q96. How coupled should your classes be and why?</b>\n- You should increase coupling to improve dependencies between classes.\n- You should limit coupling to reduce dependencies between classes.\n- You should increase coupling so that class members relate to the class purpose.\n- You should limit coupling so that class members relate to the class objective.",
        "back": "You should limit coupling to reduce dependencies between classes."
    },
    {
        "front": "<b>Q97. Which statement best describes a friend class?</b>\n- Friend classes support base class when necessary.\n- A friend class can access the private and protected members of the class in which it is declared as a friend.\n- Friend classes do not have any implementation.\n- A friend class can access only protected members of the class of which it is a friend.",
        "back": "A friend class can access the private and protected members of the class in which it is declared as a friend.\n\n[Reference](https://www.simplilearn.com/tutorials/cpp-tutorial/friend-class-in-cpp/)"
    },
    {
        "front": "<b>Q98. Which code sample demonstrates multiple inheritance?</b>\n- `class employee{ }; class stream{ }; class topper{ };`\n- `class employee{int rating;}; class stream:public employee{ };`\n- `class employee{int rating;}; class stream{int total;}; class topper: employee, stream{ };`\n- `class employeef{int rating};}: class stream{ }: class topper: public employee{ }:`",
        "back": "`class employee{int rating;}; class stream{int total;}; class topper: employee, stream{ };`"
    },
    {
        "front": "<b>Q99. What is multilevel inheritance?</b>\n- a class that does not have more than one parent.\n- a class not derived from another derived obiect.\n- not doubling single-level inheritance.\n- classes derived from other derived classes.",
        "back": "classes derived from other derived classes.\n\n[Reference](https://www.w3schools.com/cpp/cpp_inheritance_multilevel.asp)"
    },
    {
        "front": "<b>Q100. Can you have two classes with the same name in the same proiect?</b>\n- No, you cannot.\n- Yes, as long as their constructors are different.\n- Yes, as long as their methods are different.\n- Yes, as long as they are in different namespaces.",
        "back": "Yes, as long as they are in different namespaces."
    },
    {
        "front": "<b>Q101. What is the difference between an interface and an abstract class?</b>\n- Interfaces can contain code or data. Abstract classes do not contain code or data. A class can inherit from more than one abstract class but can implement only one interface.\n- Abstract classes can contain code or data. Interfaces do not contain code or data. A class can inherit from more than one abstract class but can implement only one interface.\n- Interfaces can contain code or data. Abstract classes do not contain code or data. A class can inherit from only one abstract class but can implement an unlimited number of interfaces.\n- Abstract classes can contain code or data. Interfaces do not contain code or data. A class can inherit from only one abstract class but can implement an unlimited number of interfaces.",
        "back": "Abstract classes can contain code or data. Interfaces do not contain code or data. A class can inherit from only one abstract class but can implement an unlimited number of interfaces."
    },
    {
        "front": "<b>Q102. Objects are passed by **\\_**</b>\n- value or reference, depending on the programming language used\n- value\n- value or reference, depending on the program\n- reference",
        "back": "reference"
    },
    {
        "front": "<b>Q103. If a language just implements pass-by-value parameters to functions, can the objects passed as parameters be set to new instances inside the function and their new value will return to the caller?</b>\n- Yes, but only if it is a reference and not a primitive class.\n- Yes, since the value is a reference even though it is passed by value, it can be done.\n- No, you will get a compilation error.\n- No, a local copy will be initialized and will be lost as soon as it is out of scope.",
        "back": "No, a local copy will be initialized and will be lost as soon as it is out of scope."
    },
    {
        "front": "<b>Q104. What is encapsulation?</b>\n- defining classes by focusing on what is important for a purpose\n- defining data and relevant methods together in the same class\n- making all methods private\n- using words to define classes",
        "back": "defining data and relevant methods together in the same class"
    },
    {
        "front": "<b>Q105. object are passed by \\_\\_\\_?</b>\n- value or reference, depending on the programmin language used\n- reference\n- value\n- value or reference, depending on program",
        "back": "value or reference, depending on the programmin language used"
    },
    {
        "front": "<b>Q106. What is a method?</b>\n- a function associated with data and behavior\n- the exact same thing as a function and subroutine\n- a set of variables that can change over time\n- a set of instructions designed to perform a frequently used operation within a program and return no values",
        "back": "a function associated with data and behavior"
    }
]